(function(){
	var app = angular.module("store",[]);
	/*Объявление контроллера*/
	app.controller("StoreController", function(){
	
		this.products=prods;
	});
	var prods =[
		{
			nameLink: "Учет сейфовых ячеек",
			time: "09 сентября 2016",
			price: 4.99,
			description:"Аналитический учет сейфовых ячеек банка по подразделениям банка.",
		},
		{
			nameLink: "Учет комаров в небе",
			time: "24 сентября 2016",
			price: 444.99,
			description:"Аналитический учет сейфовых ячеек банка по подразделениям банка.",
		},
		{
			nameLink: "Учет зеленых парусов",
			time: "12 октября 2016",
			price: 44424.99,
			description:"Аналитический учет сейфовых ячеек банка по подразделениям банка.",
		},
		{
			nameLink: "Учет укушенных клещей",
			time: "09 апреля 2016",
			price: 412.99,
			description:"Аналитический учет сейфовых ячеек банка по подразделениям банка.",
		},
		{
			nameLink: "Учет мандаринок",
			time: "09 нулября 2016",
			price: 145.99,
			description:"Аналитический учет сейфовых ячеек банка по подразделениям банка.",
		},
		{
			nameLink: "Учет ключей",
			time: "09 сентября 2016",
			price: 235.99,
			description:"Аналитический учет сейфовых ячеек банка по подразделениям банка.",
		},
		{
			nameLink: "Учет военных врачей",
			time: "4 февраля 2016",
			price: 3546.99,
			description:"Аналитический учет сейфовых ячеек банка по подразделениям банка.",
		},
		{
			nameLink: "Учет ласточек грачей",
			time: "03 января 2016",
			price: 235.99,
			description:"Аналитический учет сейфовых ячеек банка по подразделениям банка.",
		},
		{
			nameLink: "Учет вафлей",
			time: "12 сентября 2016",
			price: 111.99,
			description:"Аналитический учет сейфовых ячеек банка по подразделениям банка.",
		}
		
	]

})();                                                                                                                     